package homework
//ДЗ 1: Написание обобщенной функции transformCollection
//Написать обобщенную функцию transformCollection.
fun <T, R> transformCollection(collection: Collection<T>, transform: (T) -> R): List<R> {
    val result = mutableListOf<R>()
    for (item in collection) {
        result.add(transform(item))
    }
    return result
}


/*
Описание/Пошаговая инструкция выполнения домашнего задания:
1️⃣ Создание обобщенной функции для преобразования коллекций 🔄
Напишите обобщенную функцию transformCollection, которая принимает:

Коллекцию объектов 📦
Функцию для их преобразования 🎭
2️⃣ Применение преобразования ко всем элементам 🚀
Функция должна изменять каждый элемент коллекции по заданному правилу и возвращать новую коллекцию с преобразованными объектами.

💡 Пример:
 */
fun square(x: Int): Int {
    return x * x
}

fun main() {
    val numbers = listOf(1, 2, 3, 4, 5)
    val transformedNumbers = transformCollection(numbers, ::square)
    println(transformedNumbers)  // вернется: [1, 4, 9, 16, 25]
}
